/*
 * main.cc
 *
 *  Created on: 11 сент. 2021 г.
 *      Author: unyuu
 */

#include <iostream>

/*
 * ЗАДАНИЕ
 * -------
 *
 * Игра "Камни"
 *
 * 2 игрока - пользователь и компьютер - делают ходы по очереди.
 * Есть куча, в ней N камней (N = 10..20 - выбирается случайным образом)
 * За ход игрок обязан взять 1, 2 или 3 камня.
 * Кто забрал последний камень - проиграл.
 *
 * 1. Нужен цикл. Завершается цикл тогда, когда проигрывает
 *    один из игроков.
 * 2. По окончании игры спрашиваем, будем ли играть снова.
 *    Если да - переходим на следующую итерацию внешнего цикла
 * 3. Пользовательский ввод должен проверяться на корректность.
 * 4. Перед каждым ходом следует выводить текущее количество камней.
 * 5. Если ход компьютера - выводим, сколько берёт компьютер.
 *
 * ПРИМЕР:
Игра "Камни". Правила: ...
...
В куче 12 камней.
Ваш ход: 3					<--- вводится
В куче 9 камней.
Мой ход - 2					<--- вычисляется? выбирается случайно?
В куче 7 камней.
Ваш ход: 4					<--- вводится
Неверный ввод!
Ваш ход: 2					<--- вводится
В куче 5 камней.
Мой ход - 1					<--- вычисляется?...
В куче 4 камней.
Ваш ход: 3					<--- вводится
В куче 1 камней.
Мой ход - 1					<--- ВНИМАНИЕ! Компьютер не может брать больше
								 камней, чем их есть. Игрока это тоже
								 касается.
Я проиграл.
Играем снова? (1 - да, 0 - нет) 0 <--- вводится
До свидания!


 */

int main()
{


	return 0;
}



